<script lang="ts">
import {defineComponent} from 'vue'
import PetalBack from "@/components/petalBack.vue";

export default defineComponent({
  name: "Reviews",
  components: {PetalBack},
  data() {
    return {
      reviews: [
        // Новые (Part2)
        {
          name: "Мария",
          text: "Я планирую продолжить наши встречи, так как они были очень полезными. Я доволен всем результатом и тем, как мне помогла психолог."
        },
        {
          name: "Роман",
          text: "Эта психологическая помощь основана на опыте доказательной медицины. Она действительно помогает преодолеть внутренние страхи, я уже вижу результаты. Я рекомендую ее всем."
        },
        {
          name: "Dmitry",
          text: "Я остался очень доволен профессионализмом и вниманием этого специалиста. Он действительно заботится о комфорте своих пациентов."
        },

        // Старые (Part1)
        {
          name: "M123",
          text: "Очень благодарна Христине за её работу. Она помогла мне пережить депрессию и выйти из неё. Также мы работали над вопросом принятия своего тела и я ощущаю положительный эффект от тех консультаций, хоть они и были уже полгода назад, не скатываюсь в ненависть к тому, что виду в зеркале. Обращалась будучи в депрессивной фазе биполярного расстройства: искала специалиста, который знает его особенности и работает не только со здоровыми людьми, будет поддерживать меня разговорной терапией помимо таблеток. Первая консультация была очной, а остальные онлайн в зуме по видеосвязи. Очень удобный формат. Я осталась довольна! При необходимости вернуться в терапию обращусь к Христине ещё раз."
        },
        {
          name: "Ксения",
          text: "Хочу выразить Христине огромную благодарность, замечательный специалист и профессионал в своём деле. Всего за 4 месяца помогла мне выйти из депрессии и разобраться во всех интересующих меня вопросах. Теперь я научилась ценить и уважать себя, защищать свои границы, замечать свои эмоции и контролировать их. Я получила все необходимые инструменты и теперь уже могу справляться сама. Спасибо!"
        },
        {
          name: "Анна",
          text: "Спасибо Христине, было очень приятно с ней работать. Ходила на терапию год, начала больше понимать про себя, как я устроена, как реагирую, как мои установки мешают мне жить. Было очень трудно принять ответственность за свою жизнь, но благодаря Хритине у меня это получилось. Теперь я наладила свои социальные контакты и даже (во что никогда не верила) строю отношения. А самое важное, что уходя с терапии, я беру с собой очень много инструментов, которыми буду пользоваться, чтобы возвращать себя к себе, если что."
        },
        {
          name: "Ольга",
          text: "Очень хороший специалист, помогла выйти из депрессивного настроения, после терапии чувствую себя в разы лучше, появились силы двигаться вперёд, появился позитивный настрой, очень ей благодарна!)"
        },
        {
          name: "Ксения",
          text: "Всего за полтора месяца Христина помогла мне с проблемами, мучившими меня последние лет 7 - неуверенность в себе, неуверенность в отношениях с окружающими людьми, постоянное ощущение тревоги. Не раз было так, что я приходила на консультацию потерянная и истощённая собственными мыслями, а спустя час совместной работы ощущала лёгкий душевный подъём и прилив сил. Христина - исключительно внимательный к деталям специалист, с которым вы сможете понять истинные причины ваших мыслей и убрать неэффективные психологические установки. Рекомендую :)"
        },
        {
          name: "Светослав",
          text: "Настоящий специалист! Исключительно внимательная к мелочам , приятный и понимающий собеседник располагающий к себе. Всего за полтора месяца помогла мне разобраться в моих \"тараканах\" . Очень рекомендую этого специалиста!"
        },
        {
          name: "Ника",
          text: "Обратилась к Христине в очень тяжелый период. За несколько месяцев очных консультаций благодаря ей разобралась во многих вопросах, волнующих меня, наладила все сферы жизнедеятельности и вернулась к прежнему, более оптимистичному, состоянию. Теперь знаю, на что нужно обращать больше внимания для более комфортного взаимодействия с миром. Лучший специалист из всех, которых я когда-либо посещала!"
        },
        {
          name: "arctg",
          text: "Мне 26 лет, консультируюсь у Христины уже почти год (очно, один раз в неделю), вышел на нее благодаря этому сайту. Христина ощутимо изменила мое мировоззрение в куда менее мрачную сторону, улучшила мою самооценку, помогла лучше понимать других людей и налаживать с ними контакты. Благодаря консультациям я успешно начал (и продолжаю) отношения со своей девушкой. Рекомендую Христину как великолепного и тактичного специалиста."
        }
      ]
    }
  }
})
</script>

<template>
  <v-container fluid class="relative-position pa-0">
    <PetalBack/>
    <v-container fluid style="padding: 5rem 1.25rem"
    >
      <div class="title-container">
        <h3 class="title-container">Отзывы</h3>
      </div>
      <br>

      <v-row
      class="ma-4 d-flex justify-center align-center"
      >
        <v-col cols="12"
        md="10"
        class="ma-1"
        >
          <v-slide-group

          >
            <v-slide-group-item
            v-for="(item, index) in reviews"
            :key="index"
            show-arrows
            >
              <v-card class="ma-2 pa-0 review-card transparent">
                <v-card-text>
                  {{item.name}}
                  <br><br>
                  {{item.text}}
                </v-card-text>
              </v-card>
            </v-slide-group-item>
          </v-slide-group>
          <h5><em>отзывы взяты из открытых источников</em></h5>
        </v-col>
      </v-row>
    </v-container>
  </v-container>
</template>

<style scoped>
.relative-position {
  position: relative !important;
  z-index: 100 !important;
  min-height: 100vh;
}

.review-card {
  width: 40vw;
  min-width: 250px;
  height: auto;
  display: flex;
  flex-direction: column;
  justify-content: center !important;
  border-radius: 20px;
}

</style>